# 1) მომხმარებელს შემოატანინე ტემპერატურა (რიცხვი) და შემდეგ შეამოწმე:
# თუ ტემპერატურა მეტია 30-ზე -> დაბეჭდე "ძალიან ცხელა!"
# თუ ტემპერატურა მეტია 20-ზე -> დაბეჭდე "სასიამოვნო ამინდია"
# თუ ტემპერატურა მეტია 10-ზე -> დაბეჭდე "ცოტა ცივა"
# თუ ტემპერატურა მეტია 0-ზე -> დაბეჭდე "ცივა, ჩაიცვი თბილად"
# სხვა შემთხვევაში -> "გაიყინები, სახლში დარჩი!"

temp=float(input('Enter Temperature: '))
if temp>30:
    print("ძალიან ცხელა!")
elif temp>20:
    print("სასიამოვნო ამინდია")
elif temp>10:
    print("ცოტა ცივა")
elif temp>0:
    print("ცივა, ჩაიცვი თბილად")
else:
    print("გაიყინები, სახლში დარჩი!")
