# 4) მომხმარებელს შემოატანინე:
# --> ასაკი (age)
# --> სტუდენტია თუ არა (student) – შეიყვანოს "yes" ან "no"
# შემდეგ:
# თუ ასაკი ნაკლებია 12-ზე ან მეტია 65-ზე -> "ბილეთი უფასოა"
# თუ student == "yes" და ასაკი მეტია 12-ზე -> "ბილეთი ნახევარ ფასად"
# სხვა შემთხვევაში -> "სრული ფასი უნდა გადაიხადო"

age=int(input('Enter Your Age: '))
st=input('Are You A Student?')
if age<12 or age>60:
    print("ბილეთი უფასოა")
elif st=="yes" and age>12:
    print("ბილეთი ნახევარ ფასად")
else:
    print("სრული ფასი უნდა გადაიხადო")