# 1)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე რიცხვს

# შექმენი მეორე ცვლადი სადაც მომხმარებელს შემოატანინებთ რაიმე სახელს

# შეამოწმე-->

# თუ შემოყვანილი ასაკი მეტოა 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი არის --> "kote"  მაშინ დაუპრინტე --> შენი სახელია კოტე და ხარ მოხუცი
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხარ მოხუცი

# თუ ასაკი ნაკლებია 60 ზე მაშინ შეამოწმე შიგნით -->
#     თუ შემოყვანილი სახელი --> "kote" მაშინ დაუპრინტე --> შენი სახელი არის კოტე მაგრამ შენ ხარ ახალგაზრდა:
#     სხვა შემთხვევაში დაუპრინტე --> შენი სახელი არ არის კოტე მაგრამ ხალ ახალგაზრდა

# 2)
# მომხმარებელს შემოაყვანინე თავისი ასაკი.
# თუ ასაკი მეტია 18-ზე, შიგნით შეამოწმე:

#   თუ ასაკი მეტია 60-ზე, დაბეჭდე "პენსიონერი".

#   თუ არა — დაბეჭდე "ზრდასრული".

# სხვა შემთხვევაში დაბეჭდე - "ბავშვი ხარ"
# 3)
# მომხმარებელს შემოაყვანინე  რიცხვი.

# თუ რიცხვი დადებითია, შიგნით შეამოწმე:

#     თუ ლუწია, დაბეჭდე "დადებითი ლუწი".

#     თუ არა — "დადებითი კენტი".

# სხვა შემთხვევაში დაბეჭდე --> "რიცხვი უარყოფითია"

# 4)
# მომხმარებელმა შეიყვანოს ტემპერატურა.
# თუ ტემპერატურა მეტია 0-ზე, შიგნით შეამოწმე:

#   თუ მეტია 30-ზე, დაბეჭდე "ცხელა"

#   თუ არა — "ნორმალურია"

# სხვა შემთხვევაში დაუბეჭდე - "ყინვაა"

# 5)
# მომხმარებელმა შეიყვანოს ქულა (0–100).
# თუ ქულა მეტია 50-ზე, შიგნით შეამოწმე:

#   თუ მეტია 90-ზე, დაბეჭდე "შესანიშნავი"

#   თუ არა — "გასული ხარ"

# სხვა შემთხვევაში დაბეჭდე - "დაბალი ქულა"

# 6)კომენტარის სახით ახსენით თუ რა არის სია და რაშივიყენებთ მას,ასევე ახსენი თუ რით განსხვავდება იგი ცვლადისგან

# 7)შექმენი სია სადაც შეინახავ მხოლოდ სტრინგ ტიპის მონაცემებს

# 8)შექმენი სია სადაც შეინახავ მხოლოდ ინტეჯერ ტიპის მონაცემებს

# 9)შექმენი სია სადაც შეინახავ მხოლოდ ბულეან ტიპის მონაცემებს

# 10)შექმენი სია სადაც შეინახავ მხოლოდ ფლოუტ ტიპის მონაცემებს

# 11)შექმენი სია სადაც შეინახავ ყველა მონაცემთა ტიპის ელემენტს 

 