# 12)
# შექმენი სია სახელად --> first_five_numbers და ამ სიაში შეინახე ინტეჯერი რიცხვები 1 დან 5 ჩათვლით
# შექმენი მეორე სია სახელად --> second_five_numbers და ამ ცვლადში შეინახე ინტეჯერი რიცხვები 6 დან 10 ჩათვლით
# შექმენი ცვლადი სახელად --> all_numbers სადაც შეინახავ წინა ორ სიაში შენახულ რიცხვებს,გამოიყენე ცვლადის სახელები რომ მესამე სიაში გადმოიტანოთ წინა ორი სია
# საბოლოოდ დაპრინტე საბოლოო სია სადაც ორი სია გაქვთ მოთავსებული და ნახეთ შედეგი
first_five_numbers=[1,2,3,4,5]
second_five_numbers=[6,7,8,9,10]
all_numbers=[[first_five_numbers], [second_five_numbers]]
print(all_numbers)


# 13)შექმენი 5 ცვლადი სადაც შეინახავ სხვადასხვა სახელებს
# შექმენი სია სადაც შეინახავ ზემოთ 5 ცვლადში შენახულ სახელებს, hint: სიაში ჩასვით ცვლადის სახელები ,ბოლოს დაპრინტე სია

name1='emzari'
name2='nugzari'
name3='tarieli'
name4='cvata'
name5='cqmutuna'
all_names=[name1,name2,name3,name4,name5]

# 14)შექმენი სია და შეინახე 3 ელემენტი --> მოიძიე ინფორმაცია და შეასრულე შემდეგი დავალება --> გამოიტანეთ სიის თითოეული ელემენტი ცალ ცალკე ---> "ინდექსები" - ს <---   გამოყენებით

list1=['mevludi','vardo', 'shlapa', 'ma']
x=list1.index('ma')
print(x)