# 6)კომენტარის სახით ახსენით თუ რა არის სია და რაშივიყენებთ მას,ასევე ახსენი თუ რით განსხვავდება იგი ცვლადისგან

#    სია არის მონაცემთა ტიპი როგორც ინტეჯერი სტრინგი და ა.შ თუმცა სიაში შესაძლებელია შენახვა ყველა მონაცემთა ტიპისგან,
#   ცვლადში მხოლოდ მითითებული მონაცემთა ტიპის შენახვაა შესაძლებელი, ხოლო სიაში შესაძლებელია ყველა მონაცემთა ტიპის შენახვა და ყველაფრის ერთად გამოტანა.

# 7)შექმენი სია სადაც შეინახავ მხოლოდ სტრინგ ტიპის მონაცემებს

list1=['lavrenti','mevludi','durmishxani','jemali','emzari','mamuka']

# 8)შექმენი სია სადაც შეინახავ მხოლოდ ინტეჯერ ტიპის მონაცემებს

list2=[1,4,5,21,632,1111]

# 9)შექმენი სია სადაც შეინახავ მხოლოდ ბულეან ტიპის მონაცემებს

list3=[True , False, False, True]

# 10)შექმენი სია სადაც შეინახავ მხოლოდ ფლოუტ ტიპის მონაცემებს

list4=[3.0,1.2,5.001,1.242]

# 11)შექმენი სია სადაც შეინახავ ყველა მონაცემთა ტიპის ელემენტს 

list5=[1.1, 2, True, 'გენადი', [list4 , 'manana']]