

# 1)რა არის პირობითი ოპერატორები?

# პირობითი ოპერატორები არის პითონში კოდის პირობა რაც გულისხმობს იმას, რომ ჩვენი კოდი სხვადასხვა პირობის შემთხვევაში შესრულდება სხვადასხვანაირად (if,else)


# 2) რა არის ლოგიკური ოპერატორები?

# ლოგიკური ოპერატორები არის and,or რომლებსაც ვიყენებთ პირობითი ოპერატორების კოდის ბლოკში.and-ის შემთხვევაში ორივე პირობის შესრულების შემთხვევაში გამოგვიტანს ჩვენ კოდს მაგრამ თუ ერთერთი არ დაკმაყოფილდა კოდი არ გამოვა or-ის შემთხვევაში ერთერთი პირობა თუ იქნება დაკმაყოფილებული ის გამოიტანს კოდს




num=int(input('Enter Number:'))
if num>0:
    print("რიცხვი დადებითია")
else:
    print("პირობა არ შესრულდა")




x=int(input('Enter Number:'))
if x<10 or x==0:
    print('პატარა ან ნულია')
else:
    print('არ აკმაყოფილებს')

print(True and False or True or False and False and True or False and False)











