// 4)დააკონსოლლოგე შენი სახელი და გამოიტანე კონსოლში

// 5)კონსოლში გამოიტანე შენი ასაკი

// 6)კონსოლში გამოიტანე შენი სიმაღლე

// 7)ჩამოწერე ყველა მონაცემთა ტიპი(მნიშნველოვანი) და კიუწერე თ რომელი რას ნიშნავს

// 8)ზემოთ მოცემული დავალებები დააკომენტარე --> 4 და 5 დავალებები single line ით და 6 და 7 დავალებები multyline კომენტარით

// console.log('Andria')

// console.log(15)

/*
console.log(169)

number - იგივე integer ციფრები: 0123456789

string - '' ნებისმიერი ტიპის ტესქსტი (ციფრებიც)

boolean True და False 

bigint გიგანტი რიცხვები

undefined არ არსებობს

null არაფერი*/

