// პროგრამაში გქონდეს ორი ცვლადი:

// let player1 = ...
// let player2 = ...
// 1. მოთამაშეების ძალა

// player1 და player2 ცვლადებში შეინახე შემთხვევითი რიცხვები.

// თითოეული მოთამაშის საწყისი ძალა უნდა იყოს 10-დან 30-მდე.

// მაგალითად, პროგრამის გაშვებისას შეიძლება მიიღო:

// Player 1: 17
// Player 2: 24

// შემდეგ გაშვებაზე კი შეიძლება სულ სხვა რიცხვები მიიღო.

// 2. დაბეჭდე მოთამაშეების ძალა

// კონსოლში დაბეჭდე ორივე მოთამაშის საწყისი ძალა.

// მაგალითად:

// Player 1-ის ძალა: 17
// Player 2-ის ძალა: 24
// 3. სპეციალური წესი

// ახლა შეამოწმე ორივე მოთამაშე ცალ-ცალკე.

// თუ რომელიმე მოთამაშის საწყისი ძალა ზუსტად 20-ის ტოლია, მას ძალას უნდა დაემატოს 5 ქულა.

// მაგალითად:

// Player 1-ის ძალა: 20
// Player 2-ის ძალა: 24

// ამ შემთხვევაში Player 1-ს დაემატება 5 და მისი საბოლოო ძალა გახდება:

// 25

// ამიტომ ბრძოლაში უკვე უნდა შეადარო:

// Player 1 → 25
// Player 2 → 24

// და არა საწყისი 20 და 24.

// მნიშვნელოვანი: 5 ქულა ემატება მხოლოდ მაშინ, როცა ძალა ზუსტად 20 არის.
// მაგალითად, 19-ს და 21-ს არაფერი ემატება.

// 4. საბოლოო ძალების დაბეჭდვა

// დამატებითი ქულების გათვალისწინების შემდეგ დაბეჭდე ორივე მოთამაშის საბოლოო ძალა.

// მაგალითად:

// Player 1-ის საბოლოო ძალა: 25
// Player 2-ის საბოლოო ძალა: 24
// 5. გამარჯვებულის განსაზღვრა

// ახლა შეადარე მოთამაშეების საბოლოო ძალები:

// თუ Player 1-ის ძალა მეტია → დაბეჭდე "Player 1 გაიმარჯვა!"
// თუ Player 2-ის ძალა მეტია → დაბეჭდე "Player 2 გაიმარჯვა!"
// თუ ორივეს საბოლოო ძალა ერთნაირია → დაბეჭდე "ფრეა!"

let player1 = 0
let player2 = 0

player1 = Math.floor(Math.random() * 21) + 10
player2 = Math.floor(Math.random() * 21) + 10

console.log(`Player 1-ის საწყისი ძალა: ${player1}`)
console.log(`Player 2-ის საწყისი ძალა: ${player2}`)

player1 === 20 ? player1 += 5 : player2 === 20 ? player2 +=5 : null

console.log(`Player 1-ის საბოლოო ძალა: ${player1}`)
console.log(`Player 2-ის საბოლოო ძალა: ${player2}`)
console.log('იწყება ბრძოლა!')

player1 > player2 ? console.log("Player 1 გაიმარჯვა!") : player2 > player1 ? console.log("Player 2 გაიმარჯვა!") : console.log("ფრეა!")