/*
1)მოახდინეთ ორ რიცხვზე ყველა მათემატიკური ოპერაცია რაც ვისწავლეთ და ნახეთ კონსოლში მათ შედეგი

2)მოახდინეთ სტრინგების კონკატინაცია ისე რომ კონშოლში გამოვიდეს თქვენს მიერ მცირე ინფორმაცცია

3)სტრინგ რიცხვა და ნამბერ ტიპის მონაცემს შორის მოახდინეთ მათემატიკური ოპერაციები, ნახეთ თუ როგორ მუშაობს ჩვენს მიერ ახსნილი წესები
*/

/*
console.log(10 - 9)
console.log(10 + 9)
console.log(10 / 2)
console.log(10 % 9)
console.log(10 * 9)

console.log("goa " + "academy")

console.log('100' - 99)
console.log('100' / 2)
console.log('100' % 88)
*/

/*
4)იპოვე შნეი სახელის სიგრძე

5)გადაიყვანე შენი სახელი დიდიდნ პატარა ასოებში და პირიქით პატარიდან დიდში

6)შეამოწმე იწყება თუ არა შენი სახელი ასო "g" ზე

7)შექმენი სტრინგი რომელსაც ექნება white spaces ,შენი დავალებაა დაბეჭდო ის სფეისების გარეშე

8)გვაქვს სტრინგი --> "ჰიდროელექტროსადგური" შენი დავალებაა კონსოლში გამოიტანო -->"ელექტრო" გამოიყენე შესაბამისი მეთოდი

*/

console.log('andria'.length)

// 1) 
console.log('andria'.toUpperCase())

// 2)
console.log('ANDRIA'.toLowerCase())

console.log('andria'.startsWith('g'))

console.log('             goa           '.trim())


console.log("ჰიდროელექტროსადგური".slice(5,12))


