# 1)მომხმარებელს შემოატანინეთ რიცხვი,შემდეგ შეამოწმეთ -->

# ----თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის მეტი 90 ზე დააუპრინტე-->"მაღალი ქულა მიიღე"

# ----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 50 ზე მეტი დაუპრინტე --> "საშვალო ქულა მიიღე:

# ----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 30 ზე მეტი დაუპრინტე --> "დაბალი ქულა მიიღე:

# ----თუ  მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი დაუპრინტე --> "ჩაიჭერი":

# ----სხვა დამარჩენ შემთხვევაში დაუპრინტე --> "მეორედ აქ აღარ მოხვიდე"

number=float(input('Enter Your Number: '))
if number>90:
    print("მაღალი ქულა მიიღე")
elif number>50:
    print("საშვალო ქულა მიიღე")
elif number>30:
    print("დაბალი ქულა მიიღე")
elif number>10:
    print("ჩაიჭერი")
else:
    print("მეორედ აქ აღარ მოხვიდე")