// 1)შექმენით სახედლების სია , შენი დავალებაა რომ სიის ბოლოდან ამოშალო ერთ ელემენტი ,და ამის შემდეგ სიის ბოლოში ჩაამატო ორი ელემენტი --> true და "gigi"

// შემდეგ შენი დავალებააა სიის დასაწყისიდან ამოშალოთ ელემენტი და დაამატო სიის თავში სიტყვა "avtomobili" ბოლოს დაბეჭდე საბოლოო სია

let names = ['avto' , 'manuchar', 'lamzira']
names.pop()
names.push(true , 'gigi')
names.shift()
names.unshift('avtomobili')
console.log(names)

// 2)შექმენით ორი სია,ერთში იყოს სტრინგები მეორეში რიცხვები,ორივე სიაში იყოს ხუთ ხუთი ელემენტი , შენი დავალებაა ეს ორი სია ერთმანეთში გაააერთიანო, ამის შემდეგ ამ გაერთიანებულ სიის ბოლოში დაამატე true და ამოშალე პირველი ელემენტი

// ამის შემდეგ შენი დავალებაა რომ შექმნა ახალი სია სადაც იქნება მესამე ინდექსიდან მეექვსე ინდექსამდე ელემენტები .slice() გამოყენებით და დაბეჭდო ეს ახალი სია,შემდეგ Array.isArray() ის დახმარებით დაბეჭდე არის თუ არა ეს ახალი მიღებული მნშვნელობა მანდვილად სია

let strs = ['a' , 'b' , 'c' , 'd' , 'e']
let nums = [5, 10 ,500 ,15 , 900]

let all = strs.concat(nums)
all.shift()
all.push(true)

let allall = all.slice(3,6)

console.log(allall)
console.log(Array.isArray(allall))