# 6) მომხმარებელს შეაყვანინე ასაკი მანამ, სანამ არ შეიყვანს -1.
#  დაბეჭდე რამდენი ადამიანი იყო არასრულწლოვანი, სრულწლოვანი, პენსიონერი. გამოიყენე while loop + if/elif/else

არასრულწლოვანი=0
სრულწლოვანი=0
პენსიონერი=0

while True:
    age=int(input('Enter Your Age: '))
    if age==-1:
        break

    if age<18:
        არასრულწლოვანი+=1
    elif age>18 and age<65:
        სრულწლოვანი+=1
    else:
        პენსიონერი+=1

print(არასრულწლოვანი, ' არასრულწლოვანი')
print(სრულწლოვანი, ' სრულწლოვანი')
print(პენსიონერი, 'პენსიონერი')

